{
  "irVersion": "1.0",
  "project": "agent-team-prd",
  "repository": "https://github.com/plexusone/agent-team-prd",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["plexusone", "johncwang@gmail.com"],
  "releases": [
    {
      "version": "v0.4.0",
      "date": "2026-03-16",
      "highlights": [
        { "description": "Migrate GitHub organization from agentplexus to plexusone", "commit": "bd0bddf" },
        { "description": "Update to structured-plan v0.9.0 with plexusone/structured-evaluation v0.3.0", "commit": "bd0bddf" }
      ],
      "changed": [
        { "description": "Migrate module path from github.com/agentplexus to github.com/plexusone", "commit": "bd0bddf" },
        { "description": "Update all import paths and documentation URLs for plexusone org", "commit": "bd0bddf" }
      ],
      "fixed": [
        { "description": "Resolve G703 path traversal warning with input validation in deploy.go", "commit": "83de314" },
        { "description": "Resolve G115 integer overflow warning using fmt.Sprintf in prd_test.go", "commit": "83de314" },
        { "description": "Fix gofmt formatting issues", "commit": "bd5dc99" }
      ],
      "documentation": [
        { "description": "Add UTF-8 feature icons to README.md", "commit": "04447c0" },
        { "description": "Update README shields and URLs for plexusone org", "commit": "cd8f096" }
      ],
      "dependencies": [
        { "description": "Update github.com/grokify/structured-plan from v0.8.0 to v0.9.0", "commit": "bd0bddf" },
        { "description": "Update github.com/plexusone/structured-evaluation to v0.3.0", "commit": "bd0bddf" },
        { "description": "Update github.com/plexusone/mcpkit to v0.4.0", "commit": "bd0bddf" },
        { "description": "Update github.com/modelcontextprotocol/go-sdk to v1.4.1", "commit": "74e0742" }
      ],
      "infrastructure": [
        { "description": "Update CI workflows to use shared workflows", "commit": "21ed45f" },
        { "description": "Rename workflow filenames for specificity", "commit": "ed787e0" }
      ]
    },
    {
      "version": "v0.3.0",
      "date": "2026-01-30",
      "highlights": [
        { "description": "Migrate from structured-requirements to structured-plan v0.6.0 with OKR-based objectives", "commit": "9b127cb" }
      ],
      "changed": [
        { "description": "Replace legacy Objectives fields (BusinessObjectives, ProductGoals, SuccessMetrics) with OKR structure", "commit": "9b127cb" },
        { "description": "Update AddObjective() to create OKR entries in Objectives.OKRs", "commit": "9b127cb" },
        { "description": "Update AddSuccessMetric() to add KeyResults to OKR.KeyResults (top-level)", "commit": "9b127cb" },
        { "description": "Update show command to display OKRs and Key Results", "commit": "9b127cb" },
        { "description": "Update validation to check Objectives.OKRs instead of legacy fields", "commit": "9b127cb" }
      ],
      "added": [
        { "description": "Add OKR, KeyResult, PhaseTarget type aliases for structured-plan types", "commit": "9b127cb" },
        { "description": "Add Goals, GoalItem, ResultItem, Framework type aliases for goals support", "commit": "9b127cb" }
      ],
      "dependencies": [
        { "description": "Replace github.com/grokify/structured-requirements v0.3.2 with github.com/grokify/structured-plan v0.6.0", "commit": "9b127cb" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-01-26",
      "highlights": [
        { "description": "Add structured-evaluation integration for standardized PRD quality reports", "commit": "df1c186" }
      ],
      "added": [
        { "description": "Add ScoreToEvaluationReport() for converting deterministic scoring to EvaluationReport format", "commit": "df1c186" },
        { "description": "Add GenerateEvaluationTemplate() for LLM judge template generation", "commit": "df1c186" },
        { "description": "Add GenerateEvaluationTemplateWithWeights() for custom category weights", "commit": "df1c186" },
        { "description": "Add StandardCategories() returning 10 PRD evaluation categories", "commit": "df1c186" },
        { "description": "Add CategoryDescriptions() and CategoryOwners() helper functions for LLM prompts", "commit": "df1c186" },
        { "description": "Add GetCategoriesFromDocument() to extract categories including custom sections", "commit": "df1c186" },
        { "description": "Add EvaluationCategory type alias for structured-prd evaluation category", "commit": "df1c186" }
      ],
      "dependencies": [
        { "description": "Update github.com/grokify/structured-requirements to v0.3.2", "commit": "df1c186" },
        { "description": "Add github.com/agentplexus/structured-evaluation v0.2.0 (transitive)", "commit": "df1c186" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-01-25",
      "highlights": [
        { "description": "Initial release of agent-team-prd: multi-agent system for PRD creation and review", "commit": "fce94de" },
        { "description": "16 specialized agents for discovery, specification, review, and revision workflows", "commit": "fce94de" },
        { "description": "Integration with github.com/grokify/structured-requirements for PRD schema", "commit": "fce94de" }
      ],
      "added": [
        { "description": "prdtool CLI for PRD management: init, validate, score, show, view commands", "commit": "fce94de" },
        { "description": "prdtool-mcp MCP server exposing PRD operations as tools for AI assistants", "commit": "fce94de" },
        { "description": "pkg/prd package wrapping structured-requirements types with helper functions", "commit": "fce94de" },
        { "description": "pkg/scoring package for PRD quality scoring against rubric", "commit": "fce94de" },
        { "description": "pkg/views package for PM and executive view generation", "commit": "fce94de" },
        { "description": "16 agent specifications: problem-discovery, user-research, market-intel, solution-ideation, requirements, ux-journey, tech-feasibility, metrics-success, risk-compliance, prd-lead, review-board, prd-scoring, exec-explainability, issue-extractor, revision-planner, change-validator", "commit": "fce94de" },
        { "description": "Team workflow specification with DAG-based orchestration", "commit": "fce94de" },
        { "description": "Deployment specifications for Claude Code, Kiro, Gemini, ADK, AWS Bedrock, CrewAI, and Kubernetes", "commit": "fce94de" },
        { "description": "prdtool schema command for programmatic JSON Schema access from structured-requirements", "commit": "fce94de" },
        { "description": "prd_schema MCP tool for AI agent schema access", "commit": "fce94de" }
      ],
      "documentation": [
        { "description": "MkDocs documentation site configuration", "commit": "fce94de" },
        { "description": "Agent specification markdown files with roles, responsibilities, and output formats", "commit": "fce94de" },
        { "description": "README with project overview and quick start", "commit": "fce94de" }
      ],
      "dependencies": [
        { "description": "github.com/grokify/structured-requirements v0.2.0 for PRD types and schema", "commit": "fce94de" },
        { "description": "github.com/agentplexus/mcpkit v0.3.1 for MCP server runtime", "commit": "fce94de" },
        { "description": "github.com/spf13/cobra v1.10.2 for CLI framework", "commit": "fce94de" }
      ]
    }
  ]
}
